    **오늘 TIL 3줄 요약**
    
    - 파이썬과 자바스크립트는 생각보다 다양한 분야에서 사용된다.
    - 코트린은 자바보다 더 다양하고 발전된 언어이다.
    - 언어의 속도는 언어가 컴파일되는 과정에 따라 달라진다.
    
    **TIL (Today I Learned) 날짜**
    
    2024.07.28
    
    **오늘 읽은 범위**
    
    - EP06 왜 나만 오류가 자주 생길까?
    - EP07 파이썬은 왜 이렇게 인기가 많을까?
    - EP08 파이썬이 C언어보다 느린 이유는?
    - EP09 자바스크립트는 웹개발에만 쓰는 언어일까?
    - EP10 코트린은 정말로 자바와 100% 호환될까?
    
    **책에서 기억하고 싶은 내용을 써보세요.**
    
    - 에러가 날때는 문제 해결에만 집중하는 것이 아니라 문제 원인을 파악하는데에 더 집중을 해야한다. 그래야 문제 해결 방안을 찾을수 있다.
    - 프로그램 공부 개념 공부를 하는데 시간을 많이 쏟기 보다 실제로 만들어 보는 것이 실력 항샹에 더 도움이 되고 실전에서 사용할수 있는 스킬이 된다.
    - 파이썬은 자바보다 많이 쓰이며 최근에 더 인기가 많아졌다. 그 이유는 활용할수 있는 분야가 넓은데 인공지능, 웹 개발, 업무 자동화, 이미지 처리, 게임 등 많은 분야에서 쓰인다. 쓰는 사람이 많은 만큼 커뮤니티가 커서 문제 해결을 하는데 더 많은 소스들이 있다.
    - 파이썬은 인터프리트 언어로 실시간으로 컴파일을 하는 반면 C언어는 컴파일 언어로 실행하기전 컴파일을 한다. 그러기 때문에 파이썬은 컴파일을 많이 하고 C언어에 비해 시간이 많이 든다. 그 반면 C언어는 컴파일하는 횟수가 파이썬에 비해 적고 오류를 컴파일하기 전에 잡을수 있다.
    - 자바스크립트가 제일 많이 쓰이는 언어인 이유는 웹 개발 뿐 아니라 데스크탑 프로그램, 앱 개발, 게임, 3D, 머신러닝에도 쓰인다.
    - 자바와 코트린은 100% 호환 가능하며 코트린은 자바보다 더 다양하게 node js 나 react, 데이터 시각화에도 사용된다. 호환되는 이유는 자바가 컴파일 될때 가장 먼저 자바바이트로 바뀌는데 코트린도 자바바이트로 바뀌기 때문이다. 코트린의 장점은 null을 체크해주어 오류를 줄여주고 코루틴이라는 문법을 지원한다.
    
    **오늘 읽은 소감은? 떠오르는 생각을 가볍게 적어보세요**
    
    - 파이썬이 많이 사용된다고는 알았는데 데이터 사이언스나 시각화에 사용되는 것만 알았지 웹 스크랩트와 인공지능 등등 다양한 분야에서 사용되는지는 몰랐다. 인터프리트 언어와 컴파일 언어의 차이를 몰랐는데 언어의 속도의 차이가 이 때문에 나는 거라는걸 알게 되었다. 자바스크립트는 항상 프로그램언어 1위였는데 왜 그런지 이해가 안됬는데 웹 개발 외에 다른 용도로도 사용된다고 하니까 납득이 됬다.
    
    #노개북 #노마드코더 #개발자북클럽
